[
    {
        "company" : "Staples",
        "job_title" : "Machine Learning Intern",
        "responsibilities" : [
            "Refining the item-matching system by fine-tuning language models to create product embeddings for comparison with competitor websites. Leveraging Azure Data Factory to orchestrate the machine learning pipeline.",
            "Working on a conversational AI project using Retrieval-Augmented Generation (RAG) to enhance document retrieval, ranking, and answer generation for Staples’ clients.",
            "Profiled & optimized data manipulation processes, reducing latency by 50% in Staples’ product matching project."
        ]
    },

    {
        "company" : "Speridian Technologies",
        "job_title" : "System Analyst",
        "responsibilities" : [
            "Developed a project management system using Django & TensorFlow for a 50,000-employee workforce.",
            "Improved project completion rates by 30% with improved real-time analytics for better resource allocation.",
            "Utilized deep learning & NLP for sentiment analysis to optimize product strategies based on customer insights.",
            "Enhanced RESTful APIs, cutting response time by 25% for better user experience.",
            "Optimized machine learning pipelines through batch preprocessing & parallelization, achieving a 20% faster execution."
        ]
    },

    {
        "company" : "vEngage.ai",
        "job_title" : "Software Developer",
        "responsibilities" : [
            "Designed & implemented RESTful APIs using FastAPI framework, integrating with MySQL database server instances. Strengthened API security with OAuth2 Bearer flow, verifying tokens for secure authentication.",
            "Automated Docker image deployments on AWS EC2 instances with Jenkins, reducing deployment time by 40%.",
            "Created automated test scripts to replace manual testing, resulting in a 20% reduction in testing time.",
            "Built an AI-powered chatbot for post-discharge follow-up with patients, increasing patient follow-up by 25%.",
            "Mentored interns & interviewed software developers as part of the hiring team."
        ]
    }

]